yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/gpio/inc/rtl_gpio.h
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL_GPIO_H
#define RTL_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "utils/rtl_utils.h"
#if defined (CONFIG_SOC_SERIES_RTL87X2G)
#include "gpio/src/rtl87x2g/rtl_gpio_def.h"
#include "pinmux/src/rtl87x2g/pin_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3E)
#include "gpio/src/rtl87x3e/rtl_gpio_def.h"
#include "pinmux/src/rtl87x3e/pin_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3D)
#include "gpio/src/rtl87x3d/rtl_gpio_def.h"
#include "pinmux/src/rtl87x3d/pin_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL8762J)
#include "gpio/src/rtl87x2j/rtl_gpio_def.h"
#include "pinmux/src/rtl87x2j/pin_def.h"
#endif

/** \defgroup GPIO        GPIO
  * \brief
  * \{
  */

/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup GPIO_Exported_Constants GPIO Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    GPIO_Number GPIO Number
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
#ifdef GPIOA
#define GPIOA0   0     //!< GPIOA0 corresponding number is 0.
#define GPIOA1   1     //!< GPIOA1 corresponding number is 1.
#define GPIOA2   2     //!< GPIOA2 corresponding number is 2.
#define GPIOA3   3     //!< GPIOA3 corresponding number is 3.
#define GPIOA4   4     //!< GPIOA4 corresponding number is 4.
#define GPIOA5   5     //!< GPIOA5 corresponding number is 5.
#define GPIOA6   6     //!< GPIOA6 corresponding number is 6.
#define GPIOA7   7     //!< GPIOA7 corresponding number is 7.
#define GPIOA8   8     //!< GPIOA8 corresponding number is 8.
#define GPIOA9   9     //!< GPIOA9 corresponding number is 9.
#define GPIOA10  10    //!< GPIOA10 corresponding number is 10.
#define GPIOA11  11    //!< GPIOA11 corresponding number is 11.
#define GPIOA12  12    //!< GPIOA12 corresponding number is 12.
#define GPIOA13  13    //!< GPIOA13 corresponding number is 13.
#define GPIOA14  14    //!< GPIOA14 corresponding number is 14.
#define GPIOA15  15    //!< GPIOA15 corresponding number is 15.
#define GPIOA16  16    //!< GPIOA16 corresponding number is 16.
#define GPIOA17  17    //!< GPIOA17 corresponding number is 17.
#define GPIOA18  18    //!< GPIOA18 corresponding number is 18.
#define GPIOA19  19    //!< GPIOA19 corresponding number is 19.
#define GPIOA20  20    //!< GPIOA20 corresponding number is 20.
#define GPIOA21  21    //!< GPIOA21 corresponding number is 21.
#define GPIOA22  22    //!< GPIOA22 corresponding number is 22.
#define GPIOA23  23    //!< GPIOA23 corresponding number is 23.
#define GPIOA24  24    //!< GPIOA24 corresponding number is 24.
#define GPIOA25  25    //!< GPIOA25 corresponding number is 25.
#define GPIOA26  26    //!< GPIOA26 corresponding number is 26.
#define GPIOA27  27    //!< GPIOA27 corresponding number is 27.
#define GPIOA28  28    //!< GPIOA28 corresponding number is 28.
#define GPIOA29  29    //!< GPIOA29 corresponding number is 29.
#define GPIOA30  30    //!< GPIOA30 corresponding number is 30.
#define GPIOA31  31    //!< GPIOA31 corresponding number is 31.
#endif
#ifdef GPIOB
#define GPIOB0   32    //!< GPIOA32 corresponding number is 32.
#define GPIOB1   33    //!< GPIOA33 corresponding number is 33.
#define GPIOB2   34    //!< GPIOA34 corresponding number is 34.
#define GPIOB3   35    //!< GPIOA35 corresponding number is 35.
#define GPIOB4   36    //!< GPIOA36 corresponding number is 36.
#define GPIOB5   37    //!< GPIOA37 corresponding number is 37.
#define GPIOB6   38    //!< GPIOA38 corresponding number is 38.
#define GPIOB7   39    //!< GPIOA39 corresponding number is 39.
#define GPIOB8   40    //!< GPIOA40 corresponding number is 40.
#define GPIOB9   41    //!< GPIOA41 corresponding number is 41.
#define GPIOB10  42    //!< GPIOA42 corresponding number is 42.
#define GPIOB11  43    //!< GPIOA43 corresponding number is 43.
#define GPIOB12  44    //!< GPIOA44 corresponding number is 44.
#define GPIOB13  45    //!< GPIOA45 corresponding number is 45.
#define GPIOB14  46    //!< GPIOA46 corresponding number is 46.
#define GPIOB15  47    //!< GPIOA47 corresponding number is 47.
#define GPIOB16  48    //!< GPIOA48 corresponding number is 48.
#define GPIOB17  49    //!< GPIOA49 corresponding number is 49.
#define GPIOB18  50    //!< GPIOA50 corresponding number is 50.
#define GPIOB19  51    //!< GPIOA51 corresponding number is 51.
#define GPIOB20  52    //!< GPIOA52 corresponding number is 52.
#define GPIOB21  53    //!< GPIOA53 corresponding number is 53.
#define GPIOB22  54    //!< GPIOA54 corresponding number is 54.
#define GPIOB23  55    //!< GPIOA55 corresponding number is 55.
#define GPIOB24  56    //!< GPIOA56 corresponding number is 56.
#define GPIOB25  57    //!< GPIOA57 corresponding number is 57.
#define GPIOB26  58    //!< GPIOA58 corresponding number is 58.
#define GPIOB27  59    //!< GPIOA59 corresponding number is 59.
#define GPIOB28  60    //!< GPIOA60 corresponding number is 60.
#define GPIOB29  61    //!< GPIOA61 corresponding number is 61.
#define GPIOB30  62    //!< GPIOA62 corresponding number is 62.
#define GPIOB31  63    //!< GPIOA63 corresponding number is 63.
#endif
#ifdef GPIOC
#define GPIOC0   64    //!< GPIOA64 corresponding number is 64.
#define GPIOC1   65    //!< GPIOA65 corresponding number is 65.
#define GPIOC2   66    //!< GPIOA66 corresponding number is 66.
#define GPIOC3   67    //!< GPIOA67 corresponding number is 67.
#define GPIOC4   68    //!< GPIOA68 corresponding number is 68.
#define GPIOC5   69    //!< GPIOA69 corresponding number is 69.
#define GPIOC6   70    //!< GPIOA70 corresponding number is 70.
#define GPIOC7   71    //!< GPIOA71 corresponding number is 71.
#define GPIOC8   72    //!< GPIOA72 corresponding number is 72.
#define GPIOC9   73    //!< GPIOA73 corresponding number is 73.
#define GPIOC10  74    //!< GPIOA74 corresponding number is 74.
#define GPIOC11  75    //!< GPIOA75 corresponding number is 75.
#define GPIOC12  76    //!< GPIOA76 corresponding number is 76.
#define GPIOC13  77    //!< GPIOA77 corresponding number is 77.
#define GPIOC14  78    //!< GPIOA78 corresponding number is 78.
#define GPIOC15  79    //!< GPIOA79 corresponding number is 79.
#define GPIOC16  80    //!< GPIOA80 corresponding number is 80.
#define GPIOC17  81    //!< GPIOA81 corresponding number is 81.
#define GPIOC18  82    //!< GPIOA82 corresponding number is 82.
#define GPIOC19  83    //!< GPIOA83 corresponding number is 83.
#define GPIOC20  84    //!< GPIOA84 corresponding number is 84.
#define GPIOC21  85    //!< GPIOA85 corresponding number is 85.
#define GPIOC22  86    //!< GPIOA86 corresponding number is 86.
#define GPIOC23  87    //!< GPIOA87 corresponding number is 87.
#define GPIOC24  88    //!< GPIOA88 corresponding number is 88.
#define GPIOC25  89    //!< GPIOA89 corresponding number is 89.
#define GPIOC26  90    //!< GPIOA90 corresponding number is 90.
#define GPIOC27  91    //!< GPIOA91 corresponding number is 91.
#define GPIOC28  92    //!< GPIOA92 corresponding number is 92.
#define GPIOC29  93    //!< GPIOA93 corresponding number is 93.
#define GPIOC30  94    //!< GPIOA94 corresponding number is 94.
#define GPIOC31  95    //!< GPIOA95 corresponding number is 95.
#endif
#ifdef GPIOD
#define GPIOD0   96    //!< GPIOA96 corresponding number is 96.
#define GPIOD1   97    //!< GPIOA97 corresponding number is 97.
#define GPIOD2   98    //!< GPIOA98 corresponding number is 98.
#define GPIOD3   99    //!< GPIOA99 corresponding number is 99.
#define GPIOD4   100   //!< GPIOA100 corresponding number is 100.
#define GPIOD5   101   //!< GPIOA101 corresponding number is 101.
#define GPIOD6   102   //!< GPIOA102 corresponding number is 102.
#define GPIOD7   103   //!< GPIOA103 corresponding number is 103.
#define GPIOD8   104   //!< GPIOA104 corresponding number is 104.
#define GPIOD9   105   //!< GPIOA105 corresponding number is 105.
#define GPIOD10  106   //!< GPIOA106 corresponding number is 106.
#define GPIOD11  107   //!< GPIOA107 corresponding number is 107.
#define GPIOD12  108   //!< GPIOA108 corresponding number is 108.
#define GPIOD13  109   //!< GPIOA109 corresponding number is 109.
#define GPIOD14  110   //!< GPIOA110 corresponding number is 110.
#define GPIOD15  111   //!< GPIOA111 corresponding number is 111.
#define GPIOD16  112   //!< GPIOA112 corresponding number is 112.
#define GPIOD17  113   //!< GPIOA113 corresponding number is 113.
#define GPIOD18  114   //!< GPIOA114 corresponding number is 114.
#define GPIOD19  115   //!< GPIOA115 corresponding number is 115.
#define GPIOD20  116   //!< GPIOA116 corresponding number is 116.
#define GPIOD21  117   //!< GPIOA117 corresponding number is 117.
#define GPIOD22  118   //!< GPIOA118 corresponding number is 118.
#define GPIOD23  119   //!< GPIOA119 corresponding number is 119.
#define GPIOD24  120   //!< GPIOA120 corresponding number is 120.
#define GPIOD25  121   //!< GPIOA121 corresponding number is 121.
#define GPIOD26  122   //!< GPIOA122 corresponding number is 122.
#define GPIOD27  123   //!< GPIOA123 corresponding number is 123.
#define GPIOD28  124   //!< GPIOA124 corresponding number is 124.
#define GPIOD29  125   //!< GPIOA125 corresponding number is 125.
#define GPIOD30  126   //!< GPIOA126 corresponding number is 126.
#define GPIOD31  127   //!< GPIOA127 corresponding number is 127.
#endif

/** End of GPIO_Number
  * \}
  */

/**
 * \defgroup    GPIO_Pins_Define GPIO Pins Define
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
#define GPIO_Pin_0                 (BIT0)   //!< GPIO Pin 0 selected.
#define GPIO_Pin_1                 (BIT1)   //!< GPIO Pin 1 selected.
#define GPIO_Pin_2                 (BIT2)   //!< GPIO Pin 2 selected.
#define GPIO_Pin_3                 (BIT3)   //!< GPIO Pin 3 selected.
#define GPIO_Pin_4                 (BIT4)   //!< GPIO Pin 4 selected.
#define GPIO_Pin_5                 (BIT5)   //!< GPIO Pin 5 selected.
#define GPIO_Pin_6                 (BIT6)   //!< GPIO Pin 6 selected.
#define GPIO_Pin_7                 (BIT7)   //!< GPIO Pin 7 selected.
#define GPIO_Pin_8                 (BIT8)   //!< GPIO Pin 8 selected.
#define GPIO_Pin_9                 (BIT9)   //!< GPIO Pin 9 selected.
#define GPIO_Pin_10                (BIT10)  //!< GPIO Pin 10 selected.
#define GPIO_Pin_11                (BIT11)  //!< GPIO Pin 11 selected.
#define GPIO_Pin_12                (BIT12)  //!< GPIO Pin 12 selected.
#define GPIO_Pin_13                (BIT13)  //!< GPIO Pin 13 selected.
#define GPIO_Pin_14                (BIT14)  //!< GPIO Pin 14 selected.
#define GPIO_Pin_15                (BIT15)  //!< GPIO Pin 15 selected.
#define GPIO_Pin_16                (BIT16)  //!< GPIO Pin 16 selected.
#define GPIO_Pin_17                (BIT17)  //!< GPIO Pin 17 selected.
#define GPIO_Pin_18                (BIT18)  //!< GPIO Pin 18 selected.
#define GPIO_Pin_19                (BIT19)  //!< GPIO Pin 19 selected.
#define GPIO_Pin_20                (BIT20)  //!< GPIO Pin 20 selected.
#define GPIO_Pin_21                (BIT21)  //!< GPIO Pin 21 selected.
#define GPIO_Pin_22                (BIT22)  //!< GPIO Pin 22 selected.
#define GPIO_Pin_23                (BIT23)  //!< GPIO Pin 23 selected.
#define GPIO_Pin_24                (BIT24)  //!< GPIO Pin 24 selected.
#define GPIO_Pin_25                (BIT25)  //!< GPIO Pin 25 selected.
#define GPIO_Pin_26                (BIT26)  //!< GPIO Pin 26 selected.
#define GPIO_Pin_27                (BIT27)  //!< GPIO Pin 27 selected.
#define GPIO_Pin_28                (BIT28)  //!< GPIO Pin 28 selected.
#define GPIO_Pin_29                (BIT29)  //!< GPIO Pin 29 selected.
#define GPIO_Pin_30                (BIT30)  //!< GPIO Pin 30 selected.
#define GPIO_Pin_31                (BIT31)  //!< GPIO Pin 31 selected.
#define GPIO_Pin_All               ((uint32_t)0xFFFFFFFF)  //!< All pins selected.

