yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/gpio/inc/rtl_gpio.h
#define IS_GET_GPIO_PIN(PIN)       (((PIN) == GPIO_Pin_0) || \
                                    ((PIN) == GPIO_Pin_1) || \
                                    ((PIN) == GPIO_Pin_2) || \
                                    ((PIN) == GPIO_Pin_3) || \
                                    ((PIN) == GPIO_Pin_4) || \
                                    ((PIN) == GPIO_Pin_5) || \
                                    ((PIN) == GPIO_Pin_6) || \
                                    ((PIN) == GPIO_Pin_7) || \
                                    ((PIN) == GPIO_Pin_8) || \
                                    ((PIN) == GPIO_Pin_9) || \
                                    ((PIN) == GPIO_Pin_10) || \
                                    ((PIN) == GPIO_Pin_11) || \
                                    ((PIN) == GPIO_Pin_12) || \
                                    ((PIN) == GPIO_Pin_13) || \
                                    ((PIN) == GPIO_Pin_14) || \
                                    ((PIN) == GPIO_Pin_15) || \
                                    ((PIN) == GPIO_Pin_16) || \
                                    ((PIN) == GPIO_Pin_17) || \
                                    ((PIN) == GPIO_Pin_18) || \
                                    ((PIN) == GPIO_Pin_19) || \
                                    ((PIN) == GPIO_Pin_20) || \
                                    ((PIN) == GPIO_Pin_21) || \
                                    ((PIN) == GPIO_Pin_22) || \
                                    ((PIN) == GPIO_Pin_23) || \
                                    ((PIN) == GPIO_Pin_24) || \
                                    ((PIN) == GPIO_Pin_25) || \
                                    ((PIN) == GPIO_Pin_26) || \
                                    ((PIN) == GPIO_Pin_27) || \
                                    ((PIN) == GPIO_Pin_28) || \
                                    ((PIN) == GPIO_Pin_29) || \
                                    ((PIN) == GPIO_Pin_30) || \
                                    ((PIN) == GPIO_Pin_31) || \
                                    ((PIN) == GPIO_Pin_All)) //!< Check if the input parameter is valid.

#define IS_GPIO_PIN(PIN)          ((PIN) != (uint32_t)0x00) //!< Check if the input parameter is valid.

/** End of GPIO_Pins_Define
  * \}
  */

/**
 * \defgroup    GPIO_Bit_Action GPIO Bit Action
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
typedef enum
{
    Bit_RESET = 0, //!< Reset the GPIO bit.
    Bit_SET        //!< Set the GPIO bit.
} BitAction;

#define IS_GPIO_BIT_ACTION(ACTION) (((ACTION) == Bit_RESET) || ((ACTION) == Bit_SET)) //!< Check if the input parameter is valid.

/** End of GPIO_Bit_Action
  * \}
  */

/**
 * \defgroup    GPIO_Direction GPIO Direction
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
typedef enum
{
    GPIO_DIR_IN   = 0x0, //!< GPIO input direction.
    GPIO_DIR_OUT  = 0x1, //!< GPIO output direction.
} GPIODir_TypeDef;

#define IS_GPIO_DIR(DIR) (((DIR) == GPIO_DIR_IN) || ((DIR) == GPIO_DIR_OUT)) //!< Check if the input parameter is valid.

/** End of GPIO_Direction
  * \}
  */

/**
 * \defgroup    GPIO_Output_Mode GPIO Output Mode
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
typedef enum
{
    GPIO_OUTPUT_PUSHPULL  = 0x0, //!< GPIO output push-pull mode.
    GPIO_OUTPUT_OPENDRAIN = 0x1, //!< GPIO output open-drain mode.
} GPIOOutputMode_TypeDef;

#define IS_GPIO_OUTPUT_MODE(MODE) (((MODE) == GPIO_OUTPUT_PUSHPULL)|| ((MODE) == GPIO_OUTPUT_OPENDRAIN)) //!< Check if the input parameter is valid.

/** End of GPIO_Output_Mode
  * \}
  */

#if (GPIO_SUPPORT_SET_CONTROL_MODE == 1)
/**
 * \brief       GPIO control mode enumeration.
 *
 * \ingroup     GPIO_Exported_Constants
 */
typedef enum
{
    GPIO_SOFTWARE_MODE = 0x0,  //!< GPIO software control mode(default).
    GPIO_HARDWARE_MODE  = 0x1, //!< GPIO hardware control mode.
} GPIOControlMode_Typedef;

#define IS_GPIOIT_MODDE(TYPE) (((TYPE) == GPIO_SOFTWARE_MODE)\
                               || ((TYPE) == GPIO_HARDWARE_MODE)) //!< Check if the input parameter is valid.
#endif

/**
 * \defgroup    GPIO_Interrupt_Trigger GPIO Interrupt Trigger
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
typedef enum
{
    GPIO_INT_TRIGGER_LEVEL = 0x0,     //!< GPIO interrupt trigger mode is level trigger.
    GPIO_INT_TRIGGER_EDGE  = 0x1,     //!< GPIO interrupt trigger mode is edge trigger.
#if GPIO_SUPPORT_INT_BOTHEDGE
    GPIO_INT_TRIGGER_BOTH_EDGE = 0x2, //!< GPIO interrupt trigger mode is both edge trigger.
#endif
} GPIOITTrigger_TypeDef;

#define IS_GPIOIT_TRIGGER_TYPE(TYPE) (((TYPE) == GPIO_INT_TRIGGER_LEVEL) || \
                                      ((TYPE) == GPIO_INT_TRIGGER_EDGE)) //!< Check if the input parameter is valid.

/** End of GPIO_Interrupt_Trigger
  * \}
  */

/**
 * \defgroup    GPIO_Interrupt_Polarity GPIO Interrupt Polarity
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
typedef enum
{
    GPIO_INT_POLARITY_ACTIVE_LOW  = 0x0, //!< GPIO interrupt interrupt Polarity is low active.
    GPIO_INT_POLARITY_ACTIVE_HIGH = 0x1, //!< GPIO interrupt interrupt Polarity is high active.
} GPIOITPolarity_TypeDef;

#define IS_GPIOIT_POLARITY_TYPE(TYPE) (((TYPE) == GPIO_INT_POLARITY_ACTIVE_LOW) || \
                                       ((TYPE) == GPIO_INT_POLARITY_ACTIVE_HIGH)) //!< Check if the input parameter is valid.

/** End of GPIO_Interrupt_Polarity
  * \}
  */

/**
 * \defgroup    GPIO_Interrupt_Debounce GPIO Interrupt Debounce
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
typedef enum
{
    GPIO_INT_DEBOUNCE_DISABLE = 0x0, //!< Disable interrupt debounce.
    GPIO_INT_DEBOUNCE_ENABLE  = 0x1, //!< Enable interrupt debounce.
} GPIODebounce_TypeDef;

#define IS_GPIOIT_DEBOUNCE_TYPE(TYPE) (((TYPE) == GPIO_INT_DEBOUNCE_DISABLE) || \
                                       ((TYPE) == GPIO_INT_DEBOUNCE_ENABLE)) //!< Check if the input parameter is valid.

/** End of GPIO_Interrupt_Debounce
  * \}
  */

#if (GPIO_SUPPORT_RAP_FUNCTION == 1)
/**
 * \defgroup    GPIO_Qactive_Force GPIO Qactive Force
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
typedef enum
{
    GPIO_QACTIVE_PCLK_FORCE     = 0x0,
    GPIO_QACTIVE_PCLKINTR_FORCE = 0x1,
    GPIO_QACTIVE_CLK32K_FORCE   = 0x2,
} GPIOQactiveForce_TypeDef;

/** End of GPIO_Qactive_Force
  * \}
  */

/**
 * \defgroup    GPIO_Task GPIO Task
 * \{
 * \ingroup     GPIO_Exported_Constants
 */
typedef enum
{
    GPIO_TASK_DRSET = 0,
    GPIO_TASK_DRCLR = 1,
    GPIO_TASK_DRTOGGLE = 2,
    GPIO_TASK_POLSET = 3,
    GPIO_TASK_POLCLR = 4,
    GPIO_TASK_POLTOGGLE = 5,
    GPIO_TASK_DDRSET = 6,
    GPIO_TASK_DDRCLR = 7,
} GPIOTask_TypeDef;

/** End of GPIO_Task
  * \}
  */


#endif

/** End of GPIO_Exported_Constants
  * \}
  */

