yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/gpio/inc/rtl_gpio.h
/*============================================================================*
 *                         Types
 *============================================================================*/
/** \defgroup GPIO_Exported_Types GPIO Exported Types
  * \brief
  * \{
  */

/**
 * \brief       GPIO init structure definition.
 *
 * \ingroup     GPIO_Exported_Types
 */
typedef struct
{

    uint32_t                GPIO_Pin;           /**< Specify the GPIO pins to be configured.
                                                     This parameter can be a value of \ref GPIO_Pins_Define. */

    GPIODir_TypeDef         GPIO_Dir;           /**< Specify the GPIO direction.
                                                     This parameter can be a value of \ref GPIO_Direction */

    GPIOOutputMode_TypeDef  GPIO_OutPutMode;    /**< Specify the GPIO output mode.
                                                     This parameter can be a value of \ref GPIO_Output_Mode */

#if (GPIO_SUPPORT_SET_CONTROL_MODE == 1)
    GPIOControlMode_Typedef GPIO_ControlMode;   /**< Specify the GPIO mode. */
#endif

    FunctionalState         GPIO_ITCmd;         /**< Enable or disable GPIO interrupt.
                                                     This parameter can be a value of ENABLE or DISABLE. */

    GPIOITTrigger_TypeDef   GPIO_ITTrigger;     /**< Specify the GPIO interrupt trigger.
                                                     This parameter can be a value of \ref GPIO_Interrupt_Trigger */

    GPIOITPolarity_TypeDef  GPIO_ITPolarity;    /**< Specify the GPIO interrupt polarity.
                                                     This parameter can be a value of \ref GPIO_Interrupt_Polarity */

    GPIODebounce_TypeDef    GPIO_ITDebounce;    /**< Enable or disable debounce for interrupt.
                                                     This parameter can be a value of \ref GPIO_Interrupt_Debounce */

    GPIODebounceSrc_TypeDef GPIO_DebounceClkSource; /**< Select debounce count clock source.
                                                         This parameter can be a value of \ref GPIO_Debounce_Clock_Source */

    GPIODebounceDiv_TypeDef GPIO_DebounceClkDiv;    /**< Specify the debounce clock divider.
                                                         This parameter can be a value of \ref GPIO_Debounce_Divider */

    uint8_t
    GPIO_DebounceCntLimit;  /**< Specify the debounce Limit. Debounce_time = (CntLimit + 1) * GPIO_DebounceClkSource/GPIO_DebounceClkDiv.
                                                         This parameter leagel value range is from 0 ~ 255. */
} GPIO_InitTypeDef;

/** End of GPIO_Exported_Types
  * \}
  */

/*============================================================================*
 *                         Functions
 *============================================================================*/
/** \defgroup GPIO_Exported_Functions GPIO Exported Functions
  * \brief
  * \{
  */

/**
 * \brief   Deinitialize the GPIO peripheral registers to their default reset values.
 *
 * \param[in] GPIOx  Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gpio_init(void)
 * {
 *     GPIO_DeInit(GPIOA);
 * }
 * \endcode
 */
void GPIO_DeInit(GPIO_TypeDef *GPIOx);

/**
 * \brief  Initialize the GPIO peripheral according to the specified
 *         parameters in the GPIO_InitStruct.
 *
 * \param[in] GPIOx            Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_InitStruct  Pointer to a GPIO_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gpio_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_GPIOA, APBPeriph_GPIOA_CLOCK, ENABLE);
 *
 *     GPIO_InitTypeDef GPIO_InitStruct;
 *     GPIO_StructInit(&GPIO_InitStruct);
 *     GPIO_InitStruct.GPIO_Pin         = GPIO_GetPinBit(P0_0);
 *     GPIO_InitStruct.GPIO_Dir         = GPIO_DIR_IN;
 *     GPIO_InitStruct.GPIO_OutPutMode  = GPIO_OUTPUT_PUSHPULL;
 *     GPIO_InitStruct.GPIO_ITCmd       = ENABLE;
 *     GPIO_InitStruct.GPIO_ITTrigger   = GPIO_INT_TRIGGER_EDGE;
 *     GPIO_InitStruct.GPIO_ITPolarity  = GPIO_INT_POLARITY_ACTIVE_LOW;
 *     GPIO_InitStruct.GPIO_ITDebounce  = GPIO_INT_DEBOUNCE_ENABLE;
 *     GPIO_InitStruct.GPIO_DebounceClkSource = GPIO_DEBOUNCE_32K;
 *     GPIO_InitStruct.GPIO_DebounceClkDiv    = GPIO_DEBOUNCE_DIVIDER_1;
 *     GPIO_InitStruct.GPIO_DebounceCntLimit  = 20;
 *     GPIO_Init(GPIOA, &GPIO_InitStruct);
 *
 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = GPIOA0_IRQn;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);

 *     GPIO_MaskINTConfig(GPIOA, GPIO_GetPinBit(P0_0), DISABLE);
 *     GPIO_INTConfig(GPIOA, GPIO_GetPinBit(P0_0), ENABLE);
 * }
 * \endcode
 */
void GPIO_Init(GPIO_TypeDef *GPIOx, GPIO_InitTypeDef *GPIO_InitStruct);

/**
 * \brief    Fill each GPIO_InitStruct member with its default value.
 *
 * \note The default settings for the GPIO_InitStruct member are shown in the following table:
 *       | GPIO_InitStruct member          | Default value                         |
 *       |:-------------------------------:|:-------------------------------------:|
 *       | GPIO_Pin                        | \ref GPIO_Pin_All                     |
 *       | GPIO_Dir                        | \ref GPIO_DIR_IN                      |
 *       | GPIO_OutPutMode                 | \ref GPIO_OUTPUT_PUSHPULL             |
 *       | GPIO_ITCmd                      | DISABLE                               |
 *       | GPIO_ITTrigger                  | \ref GPIO_INT_TRIGGER_LEVEL           |
 *       | GPIO_ITPolarity                 | \ref GPIO_INT_POLARITY_ACTIVE_LOW     |
 *       | GPIO_ITDebounce                 | \ref GPIO_INT_DEBOUNCE_DISABLE        |
 *       | GPIO_DebounceClkSource          | \ref GPIO_DEBOUNCE_32K                |
 *       | GPIO_DebounceClkDiv             | \ref GPIO_DEBOUNCE_DIVIDER_1          |
 *       | GPIO_DebounceCntLimit           | 32                                    |
 *
 * \param[in] GPIO_InitStruct  Pointer to a GPIO_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gpio_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_GPIOA, APBPeriph_GPIOA_CLOCK, ENABLE);
 *
 *     GPIO_InitTypeDef GPIO_InitStruct;
 *     GPIO_StructInit(&GPIO_InitStruct);
 *     GPIO_InitStruct.GPIO_Pin        = GPIO_GetPinBit(P0_0);
 *     GPIO_InitStruct.GPIO_Dir        = GPIO_DIR_IN;
 *     GPIO_InitStruct.GPIO_OutPutMode = GPIO_OUTPUT_PUSHPULL;
 *     GPIO_InitStruct.GPIO_ITCmd      = ENABLE;
 *     GPIO_InitStruct.GPIO_ITTrigger  = GPIO_INT_TRIGGER_EDGE;
 *     GPIO_InitStruct.GPIO_ITPolarity = GPIO_INT_POLARITY_ACTIVE_LOW;
 *     GPIO_InitStruct.GPIO_ITDebounce  = GPIO_INT_DEBOUNCE_ENABLE;
 *     GPIO_InitStruct.GPIO_DebounceClkSource = GPIO_DEBOUNCE_32K;
 *     GPIO_InitStruct.GPIO_DebounceClkDiv    = GPIO_DEBOUNCE_DIVIDER_1;
 *     GPIO_InitStruct.GPIO_DebounceCntLimit  = 20;
 *     GPIO_Init(GPIOA, &GPIO_InitStruct);
 * }
 * \endcode
 */
void GPIO_StructInit(GPIO_InitTypeDef *GPIO_InitStruct);

/**
 * \brief   Enable or disable the specified GPIO pin interrupt.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the GPIO pins to be configured.
 *                      This parameter can be one of GPIO_Pin where can be 0~31.
 * \param[in] NewState  New state of the GPIOx interrupt.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the interrupt of the specified GPIO pin.
 *                      - DISABLE: Disable the interrupt of the specified GPIO pin.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_gpio_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_GPIOA, APBPeriph_GPIOA_CLOCK, ENABLE);
 *
 *     GPIO_InitTypeDef GPIO_InitStruct;
 *     GPIO_StructInit(&GPIO_InitStruct);
 *     GPIO_InitStruct.GPIO_Pin         = GPIO_GetPinBit(P0_0);
 *     GPIO_InitStruct.GPIO_Dir         = GPIO_DIR_IN;
 *     GPIO_InitStruct.GPIO_OutPutMode  = GPIO_OUTPUT_PUSHPULL;
 *     GPIO_InitStruct.GPIO_ITCmd       = ENABLE;
 *     GPIO_InitStruct.GPIO_ITTrigger   = GPIO_INT_TRIGGER_EDGE;
 *     GPIO_InitStruct.GPIO_ITPolarity  = GPIO_INT_POLARITY_ACTIVE_LOW;
 *     GPIO_InitStruct.GPIO_ITDebounce  = GPIO_INT_DEBOUNCE_ENABLE;
 *     GPIO_InitStruct.GPIO_DebounceClkSource = GPIO_DEBOUNCE_32K;
 *     GPIO_InitStruct.GPIO_DebounceClkDiv    = GPIO_DEBOUNCE_DIVIDER_1;
 *     GPIO_InitStruct.GPIO_DebounceCntLimit  = 20;
 *     GPIO_Init(GPIOA, &GPIO_InitStruct);
 *
 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = GPIOA0_IRQn;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);

 *     GPIO_MaskINTConfig(GPIOA, GPIO_GetPinBit(P0_0), DISABLE);
 *     GPIO_INTConfig(GPIOA, GPIO_GetPinBit(P0_0), ENABLE);
 * }
 * \endcode
 */
void GPIO_INTConfig(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin, FunctionalState NewState);


/**
 * \brief   Clear the specified GPIO pin interrupt pending bit.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the GPIO pins to be configured.
 *                      This parameter can be one of GPIO_Pin where can be 0~31.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     driver_gpio_init();
 * }
 *
 * void GPIOA0_Handler(void)
 * {
 *     GPIO_INTConfig(GPIOA, GPIO_GetPinBit(P0_0), DISABLE);
 *     GPIO_MaskINTConfig(GPIOA, GPIO_GetPinBit(P0_0), ENABLE);
 *     //Add user code here.
 *     GPIO_ClearINTPendingBit(GPIOA, GPIO_GetPinBit(P0_0));
 *     GPIO_MaskINTConfig(GPIOA, GPIO_GetPinBit(P0_0), DISABLE);
 *     GPIO_INTConfig(GPIOA, GPIO_GetPinBit(P0_0), ENABLE);
}
 * \endcode
 */
void GPIO_ClearINTPendingBit(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin);


/**
 * \brief   Mask or unmask the specified GPIO pin interrupt.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the GPIO pins to be configured.
 *                      This parameter can be one of GPIO_Pin where can be 0~31.
 * \param[in] NewState  Mask or unmask interrupt.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 *
 * void gpio_demo(void)
 * {
 *     driver_gpio_init();
 * }
 *
 * void GPIOA0_Handler(void)
 * {
 *     GPIO_INTConfig(GPIOA, GPIO_GetPinBit(P0_0), DISABLE);
 *     GPIO_MaskINTConfig(GPIOA, GPIO_GetPinBit(P0_0), ENABLE);
 *
 *     //Add user code here.
 *
 *     GPIO_ClearINTPendingBit(GPIOA, GPIO_GetPinBit(P0_0));
 *     GPIO_MaskINTConfig(GPIOA, GPIO_GetPinBit(P0_0), DISABLE);
 *     GPIO_INTConfig(GPIOA, GPIO_GetPinBit(P0_0), ENABLE);
 * }
 * \endcode
 */
void GPIO_MaskINTConfig(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin, FunctionalState NewState);

/**
 * \brief   Get GPIO group through the given pad.
 *
 * \param[in] Pin_num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * \return  GPIOx(x is 0~31) value. Refer to \ref GPIO_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 *
 * void gpio_demo(void)
 * {
 *      GPIO_TypeDef gpio_port = GPIO_GetPort(P0_0);
 *      //result: gpio_port is GPIOA
 * }
 *
 * \endcode
 */
GPIO_TypeDef *GPIO_GetPort(uint8_t Pin_num);

/**
 * \brief   Get the GPIO_Pin (GPIO0 ~ GPIO31) through the given PAD num.
 *
 * \param[in] Pin_num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * \return  GPIOx(x is 0~31) value. Refer to \ref GPIO_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     uint32_t gpio_pin = GPIO_GetPinBit(P0_0);
 *     //result: gpio_pin is GPIO_Pin_0
 * }
 * \endcode
 */
uint32_t GPIO_GetPinBit(uint8_t Pin_num);

/**
 * \brief   Get GPIO value ( \ref GPIO_Declaration ) through the given pad.
 *
 * \param[in] Pin_num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * \return  GPIOx(x is 0~31) value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     uint8_t gpio_num = GPIO_GetNum(P0_0);
 *     //result: gpio_num = 0, i.e. GPIOA0.
 * }
 * \endcode
 */
uint8_t GPIO_GetNum(uint8_t Pin_num);

/**
 * \brief   Enable or disable the debounce counter function and clock.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the GPIO pins to be configured.
 *                      This parameter can be one of GPIO_Pin where can be 0~31..
 * \param[in] NewState  NewState of GPIO debounce counter function and clock.
 *                      - ENABLE: Enable debounce counter function and clock of the specified pin.
 *                      - DISABLE: Reset the counter and output of external debounce.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     GPIO_ExtDebCmd(GPIOA, GPIO_GetPinBit(P0_0), ENABLE);
 * }
 * \endcode
 */
void GPIO_ExtDebCmd(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin, FunctionalState NewState);

/**
 * \brief  Set GPIO debounce parameters.
 *
 * \param[in]  GPIOx                  where x can be A to D to select the GPIO peripheral.
 * \param[in]  GPIO_Pin               Specify the GPIO pins to be configured.
 *                                    This parameter can be one of GPIO_Pin where can be 0~31.
 * \param[in]  GPIO_DebounceClkDiv    Debounce clock divider selection.
 * \param[in]  GPIO_DebounceCntLimit  Debounce time can be calculated by count limit.
 *                                    Debounce_time = (CntLimit + 1) * GPIO_DebounceClkSource/GPIO_DebounceClkDiv.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     GPIO_ExtDebUpdate(GPIOA, GPIO_GetPinBit(P0_0), GPIO_DEBOUNCE_32K, GPIO_DEBOUNCE_DIVIDER_1, 20);
 * }
 * \endcode
 */
void GPIO_ExtDebUpdate(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin,
                       GPIODebounceSrc_TypeDef GPIO_DebounceClkSource,
                       GPIODebounceDiv_TypeDef GPIO_DebounceClkDiv, uint8_t GPIO_DebounceCntLimit);

/**
 * \brief   Read the specified input pin.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the port bit to read.
 *                      This parameter can be \ref GPIO_Pin where can be 0~31.
 *
 * \return  GPIO input port pin value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     uint8_t input_bit = GPIO_ReadInputDataBit(GPIOA, GPIO_GetPinBit(P0_0));
 * }
 * \endcode
 */
uint8_t GPIO_ReadInputDataBit(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin);

/**
 * \brief  Read value of all GPIO input data.
 *
 * \param[in] GPIOx  Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 *
 * \return GPIO input data port value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     uint32_t input_data = GPIO_ReadInputData(GPIOA);
 * }
 * \endcode
 */
uint32_t GPIO_ReadInputData(GPIO_TypeDef *GPIOx);

/**
 * \brief   Read the specified output port pin.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the port bit to read.
 *                      This parameter can be GPIO_Pin where can be 0~31.
 *
 * \return GPIO output port pin value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     uint8_t output_bit = GPIO_ReadOutputDataBit(GPIOA, GPIO_GetPinBit(P0_0));
 * }
 * \endcode
 */
uint8_t GPIO_ReadOutputDataBit(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin);

/**
 * \brief   Read value of all GPIO output data port.
 *
 * \param[in] GPIOx  Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 *
 * \return  GPIO output data port value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     uint32_t output_data = GPIO_ReadOutputData(GPIOA);
 * }
 * \endcode
 */
uint32_t GPIO_ReadOutputData(GPIO_TypeDef *GPIOx);

/**
 * \brief   Set the selected data port bit.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the port bit to be written.
 *                      This parameter can be GPIO_Pin_x where x can be 0~31 or GPIO_Pin_All.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     GPIO_SetBits(GPIOA, GPIO_GetPinBit(P0_0));
 * }
 * \endcode
 */
void GPIO_SetBits(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin);

/**
 * \brief   Reset the selected data port bit.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the port bits to be written.
 *                      This parameter can be GPIO_Pin_0 to GPIO_Pin_31 or GPIO_Pin_All.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     GPIO_ResetBits(GPIOA, GPIO_GetPinBit(P0_0));
 * }
 * \endcode
 */
void GPIO_ResetBits(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin);

/**
 * \brief  Set or clear the selected data port bit.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the port bit to be written.
 *                      This parameter can be one of GPIO_Pin where can be 0~31.
 * \param[in] BitVal    Specify the value to be written to the selected bit.
 *                      This parameter can be one of the BitAction enum values:
 *                      - Bit_RESET: To clear the port pin.
 *                      - Bit_SET: To set the port pin.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     GPIO_WriteBit(GPIOA, GPIO_GetPinBit(P0_0), Bit_SET);
 * }
 * \endcode
 */
void GPIO_WriteBit(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin, BitAction BitVal);

/**
 * \brief   Set or clear data port.
 *
 * \param[in] GPIOx    Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] PortVal  Specify the value to be written to the selected bit.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     GPIO_Write(GPIOA, 0xFFFFFFFF);
 * }
 * \endcode
 */
void GPIO_Write(GPIO_TypeDef *GPIOx, uint32_t PortVal);


/**
 * \brief  Get GPIO interrupt status.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the GPIO pins to be configured.
 *                      This parameter can be one of GPIO_Pin where can be 0~31.
 *
 * \return The new state of interrupt status (SET or RESET).
 *         - SET: The interrupt status is set.
 *         - RESET: The interrupt status has not been set.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     ITStatus int_status = GPIO_GetINTStatus(GPIOA, GPIO_GetPinBit(P0_0));
 * }
 * \endcode
 */
ITStatus GPIO_GetINTStatus(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin);

/**
 * \brief  Specify the direction for the selected pins.
 *
 * \param[in] GPIOx        Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_PinBit  Specify the GPIO pins to be configured, Refer to \ref GPIO_Pins_Define.
 * \param[in] GPIO_Dir     Set the GPIO direction.
 *                         This parameter can be one of the following values:
 *                         - GPIO_DIR_IN: The direction is input.
 *                         - GPIO_DIR_OUT: The direction is output.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     GPIO_SetDirection(GPIOA, GPIO_GetPinBit(P3_0), GPIO_DIR_IN);
 * }
 * \endcode
 */
void GPIO_SetDirection(GPIO_TypeDef *GPIOx, uint32_t GPIO_PinBit,
                       GPIODir_TypeDef GPIO_Dir);

/**
 * \brief  Set GPIO output mode.
 *
 * \param[in] GPIOx            Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin         Specify the GPIO pins to be configured.Refer to \ref GPIO_Pins_Define.
 * \param[in] GPIO_OutputMode  Specify the output mode to be set.
 *                             This parameter can be one of the \ref GPIO_Output_Mode enum values:
 *                             - GPIO_OUTPUT_OPENDRAIN: Setting Output push-pull Mode.
 *                             - GPIO_OUTPUT_PUSHPULL: Setting Output open-drain Mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     GPIO_SetOutputMode(GPIOA, GPIO_GetPinBit(P0_0), GPIO_OUTPUT_OPENDRAIN);
 * }
 * \endcode
 */
void GPIO_SetOutputMode(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin,
                        GPIOOutputMode_TypeDef GPIO_OutputMode);

/**
 * \brief  Get GPIO pad status.
 *
 * \param[in] GPIO_Pin  Specify the GPIO pins to be configured.Refer to \ref GPIO_Pins_Define.
 *
 * \return  The new state of GPIO_Pad.
 *          - SET: The GPIO pad has been set.
 *          - RESET: Failed to set the GPIO pad.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void gpio_demo(void)
 * {
 *     FlagStatus status = GPIO_GetPadStatus(GPIOA, GPIO_GetPinBit(P0_0));
 * }
 * \endcode
 */
FlagStatus GPIO_GetPadStatus(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin);

/**
 * \brief  Set GPIO Interript Polarity.
 *
 * \param[in] GPIOx     Select the GPIO peripheral. Refer to \ref GPIO_Declaration.
 * \param[in] GPIO_Pin  Specify the GPIO pins to be configured.Refer to \ref GPIO_Pins_Define.
 * \param[in] int_type  Specify the polarity type to be set.
 *                      This parameter can be one of the \ref GPIO_Interrupt_Polarity enum values:
 *                      - GPIO_INT_POLARITY_ACTIVE_LOW: Setting interrupt to low active.
 *                      - GPIO_INT_POLARITY_ACTIVE_HIGH: Setting interrupt to high active.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void GPIO_Init(void)
 * {
 *     GPIO_SetPolarity(GPIOx, GPIO_Pin, GPIO_INT_POLARITY_ACTIVE_LOW);
 * }
 * \endcode
 */
void GPIO_SetPolarity(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin,
                      GPIOITPolarity_TypeDef int_type);

#if (GPIO_SUPPORT_RAP_FUNCTION == 1)

void GPIO_RAPQactiveCtrl(GPIO_TypeDef *GPIOx, uint32_t Qactive, FunctionalState NewState);

void GPIO_RAPModeCmd(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin, FunctionalState NewState);

void GPIO_TaskTrigger(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pin, uint32_t Task);

#endif

/** End of GPIO_Exported_Functions
  * \}
  */

/** End of GPIO
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /* RTL_GPIO_H */

